RT-Thread/rt-thread/bsp/nxp/mcx/mcxc/Libraries/MCXC444/MCXC444/drivers/fsl_ftfx_flash.c
        /* if protectStatusCounter == 0, then no region of the desired flash region is protected */
        if (protectStatusCounter == 0U)
        {
            *protection_state = kFLASH_ProtectionStateUnprotected;
        }
        /* if protectStatusCounter == regionCheckedCounter, then each region checked was protected */
        else if (protectStatusCounter == regionCheckedCounter)
        {
            *protection_state = kFLASH_ProtectionStateProtected;
        }
        /* if protectStatusCounter != regionCheckedCounter, then protection status is mixed
         * In other words, some regions are protected while others are unprotected */
        else
        {
            *protection_state = kFLASH_ProtectionStateMixed;
        }
    }
#if (FTFx_FLASH_COUNT > 1U)
    else
    {
        *protection_state = kFLASH_ProtectionStateUnprotected;
    }
#endif

    return kStatus_FTFx_Success;
}

#if defined(FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL) && FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL
/*!
 * @brief Returns the access state of the desired flash area via the pointer passed into the function.
 *
 * This function retrieves the current flash access status for a given
 * flash area as determined by the start address and length.
 */
status_t FLASH_IsExecuteOnly(flash_config_t *config,
                             uint32_t start,
                             uint32_t lengthInBytes,
                             flash_xacc_state_t *access_state)
{
    status_t returnCode;
    ftfx_config_t *ftfxConfig;
    uint8_t flashIndex;

    if (access_state == NULL)
    {
        return kStatus_FTFx_InvalidArgument;
    }

    returnCode = flash_check_range_to_get_index(config, start, lengthInBytes, &flashIndex);
    if (returnCode != kStatus_FTFx_Success)
    {
        return returnCode;
    }

    ftfxConfig = &config->ftfxConfig[flashIndex];

    /* store the execute only segment count */
    uint32_t executeOnlySegmentCounter = 0U;

    /* Calculate end address */
    uint32_t endAddress = start + lengthInBytes;

    /* Aligning start address and end address */
    uint32_t alignedStartAddress = ALIGN_DOWN(start, ftfxConfig->flashDesc.accessSegmentMem.size);
    uint32_t alignedEndAddress   = ALIGN_UP(endAddress, ftfxConfig->flashDesc.accessSegmentMem.size);

    uint32_t u32flag      = 1U;
    uint32_t segmentIndex = 0U;

    /* Calculate the execute only segment Count */
    uint32_t maxSupportedExecuteOnlySegmentCount =
        (alignedEndAddress - alignedStartAddress) / ftfxConfig->flashDesc.accessSegmentMem.size;

    while (start < endAddress)
    {
        uint32_t xacc              = 0U;
        bool isInvalidSegmentIndex = false;

        /* Calculate which segmentIndex the address is in */
        segmentIndex =
            (start - ftfxConfig->flashDesc.accessSegmentMem.base) / ftfxConfig->flashDesc.accessSegmentMem.size;

        if ((0U == ftfxConfig->flashDesc.index) || (0U != ftfxConfig->flashDesc.feature.hasIndXaccReg))
        {
            /* For primary flash, The eight XACC registers allow up to 64 restricted segments of equal memory size.
             */
            if (segmentIndex < 32U)
            {
                xacc = *(const volatile uint32_t *)(uint32_t)&FTFx_XACCL3_REG;
            }
            else if (segmentIndex < ftfxConfig->flashDesc.accessSegmentMem.count)
            {
                xacc = *(const volatile uint32_t *)(uint32_t)&FTFx_XACCH3_REG;
                segmentIndex -= 32U;
            }
            else
            {
                isInvalidSegmentIndex = true;
            }
        }
#if defined(FTFx_FLASH1_HAS_INT_XACC_REG) && FTFx_FLASH1_HAS_INT_XACC_REG
        else if ((ftfxConfig->flashDesc.index == 1U) && (0u != ftfxConfig->flashDesc.feature.hasIndXaccReg))
        {
            /* For secondary flash, The two XACCS registers allow up to 16 restricted segments of equal memory size.
             */
            if (segmentIndex < 8U)
            {
                xacc = *(const volatile uint8_t *)&FTFx_XACCSL_REG;
            }
            else if (segmentIndex < ftfxConfig->flashDesc.accessSegmentMem.count)
            {
                xacc = *(const volatile uint8_t *)&FTFx_XACCSH_REG;
                segmentIndex -= 8U;
            }
            else
            {
                isInvalidSegmentIndex = true;
            }
        }
#endif
        else
        {
            return kStatus_FTFx_InvalidArgument;
        }

        if (isInvalidSegmentIndex)
        {
            break;
        }

        /* Determine if this address range is in a execute-only protection flash segment. */
        if (0U != ((~xacc) & (u32flag << segmentIndex)))
        {
            executeOnlySegmentCounter++;
        }
        /* Calculate tne next start address */
        start += ftfxConfig->flashDesc.accessSegmentMem.size;
    }

    if (executeOnlySegmentCounter < 1u)
    {
        *access_state = kFLASH_AccessStateUnLimited;
    }
    else if (executeOnlySegmentCounter < maxSupportedExecuteOnlySegmentCount)
    {
        *access_state = kFLASH_AccessStateMixed;
    }
    else
    {
        *access_state = kFLASH_AccessStateExecuteOnly;
    }

    return kStatus_FTFx_Success;
}
#endif /* FSL_FEATURE_FLASH_HAS_ACCESS_CONTROL */

/*!
 * @brief Sets the PFlash Protection to the intended protection status.
 *
 * @param config A pointer to storage for the driver runtime state.
 * @param protectStatus The expected protect status to set to the PFlash protection register. Each bit is
 * corresponding to protection of 1/32(64) of the total PFlash. The least significant bit is corresponding to the lowest
 * address area of PFlash. The most significant bit is corresponding to the highest address area of PFlash. There are
 * two possible cases as shown below:
 *       0: this area is protected.
 *       1: this area is unprotected.
 *
 * @retval #kStatus_FTFx_Success API was executed successfully.
 * @retval #kStatus_FTFx_InvalidArgument An invalid argument is provided.
 * @retval #kStatus_FTFx_CommandFailure Run-time error during command execution.
 */
status_t FLASH_PflashSetProtection(flash_config_t *config, pflash_prot_status_t *protectStatus)
{
    if ((config == NULL) || (protectStatus == NULL))
    {
        return kStatus_FTFx_InvalidArgument;
    }

